#Определение чётности числа:
#Пользователь вводит целое число, а программа определяет, является ли оно чётным или нечётным, и выводит соответствующее сообщени


number = int(input("Введите число"))
if number % 2 == 0:
    print("Число четное")
else:
    print("Не четное число")



