#Площадь прямоугольного треугольника:
#Пользователь вводит длины катетов прямоугольного треугольника, а программа вычисляет и выводит его площадь.


leg1 = int(input("Введите катета 1 !"))
leg2 = int(input("Введите катета 2!"))
square = (leg1*leg2)/2
print(square)
